{"format": "graph-model", "generatedBy": "2.0.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Output_Layer/b3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/w3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Second_Hidden_Layer/b2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Second_Hidden_Layer/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "First_Hidden_Layer/b1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "First_Hidden_Layer/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "beta2_power", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "beta1_power", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Second_Hidden_Layer/w2/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Second_Hidden_Layer/w2/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Second_Hidden_Layer/b2/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Second_Hidden_Layer/b2/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Output_Layer/w3/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Output_Layer/w3/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Output_Layer/b3/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Output_Layer/b3/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "First_Hidden_Layer/w1/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "First_Hidden_Layer/w1/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "First_Hidden_Layer/b1/Adam_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "First_Hidden_Layer/b1/Adam", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "First_Hidden_Layer/MatMul", "op": "MatMul", "input": ["X", "First_Hidden_Layer/w1"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "First_Hidden_Layer/add", "op": "AddV2", "input": ["First_Hidden_Layer/MatMul", "First_Hidden_Layer/b1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "First_Hidden_Layer/Relu", "op": "Relu", "input": ["First_Hidden_Layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Second_Hidden_Layer/MatMul", "op": "MatMul", "input": ["First_Hidden_Layer/Relu", "Second_Hidden_Layer/w2"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Second_Hidden_Layer/add", "op": "AddV2", "input": ["Second_Hidden_Layer/MatMul", "Second_Hidden_Layer/b2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Second_Hidden_Layer/Relu", "op": "Relu", "input": ["Second_Hidden_Layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/MatMul", "op": "MatMul", "input": ["Second_Hidden_Layer/Relu", "Output_Layer/w3"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Output_Layer/add", "op": "AddV2", "input": ["Output_Layer/MatMul", "Output_Layer/b3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_Layer/Softmax", "op": "Softmax", "input": ["Output_Layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "prediction", "op": "ArgMax", "input": ["Output_Layer/Softmax", "prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "Output_Layer/b3", "shape": [10], "dtype": "float32"}, {"name": "Output_Layer/w3", "shape": [64, 10], "dtype": "float32"}, {"name": "Second_Hidden_Layer/b2", "shape": [64], "dtype": "float32"}, {"name": "Second_Hidden_Layer/w2", "shape": [512, 64], "dtype": "float32"}, {"name": "First_Hidden_Layer/b1", "shape": [512], "dtype": "float32"}, {"name": "First_Hidden_Layer/w1", "shape": [784, 512], "dtype": "float32"}]}]}